In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pycountry as pc

In [2]:
# Data Extraction
ac_df = pd.read_csv('resources/alcohol_consumption.csv', skiprows=1)
ac_df.head()

       Country  Year     Both sexes            Male         Female
0  Afghanistan  2016  0.2 [0.2-0.2]   0.4 [0.4-0.4]        0 [0-0]
1  Afghanistan  2010  0.2 [0.2-0.3]   0.4 [0.4-0.5]        0 [0-0]
2      Albania  2016  7.5 [7.1-7.8]  12.5 [12-13.1]  2.6 [2.5-2.7]
3      Albania  2010  7.9 [7.6-8.2]  13 [12.4-13.5]    2.8 [2.7-3]
4      Algeria  2016    0.9 [0.9-1]   1.7 [1.6-1.7]  0.2 [0.2-0.2]

In [3]:
ac_copy_df = ac_df.copy()
ac_copy_df = ac_copy_df.rename(columns={"Both sexes": "Both_Sexes"})
ac_copy_df.head()

       Country  Year     Both_Sexes            Male         Female
0  Afghanistan  2016  0.2 [0.2-0.2]   0.4 [0.4-0.4]        0 [0-0]
1  Afghanistan  2010  0.2 [0.2-0.3]   0.4 [0.4-0.5]        0 [0-0]
2      Albania  2016  7.5 [7.1-7.8]  12.5 [12-13.1]  2.6 [2.5-2.7]
3      Albania  2010  7.9 [7.6-8.2]  13 [12.4-13.5]    2.8 [2.7-3]
4      Algeria  2016    0.9 [0.9-1]   1.7 [1.6-1.7]  0.2 [0.2-0.2]

In [4]:
# Data Transformation
rate_men = ac_copy_df['Male'].to_list()

rate_men_clean = []

for rate in rate_men:
    rate = rate.split(" ")
    rate_men_clean.append(rate[0])

# rate_men_clean

In [5]:
rate_women = ac_copy_df['Female'].to_list()

rate_women_clean = []

for rate in rate_women:
    rate = rate.split(" ")
    rate_women_clean.append(rate[0])
    
# rate_women_clean

In [6]:
rate_both_sexes = ac_copy_df['Both_Sexes'].to_list()

rate_both_clean = []

for rate in rate_both_sexes:
    rate = rate.split(" ")
    rate_both_clean.append(rate[0])

# rate_both_clean

In [7]:
countries = ac_copy_df['Country']
years = ac_copy_df['Year']

# print(countries)
# print(years)

In [8]:
# create clean/transformed dataframe
ac_clean_df = pd.DataFrame({"Country_Name": countries,
                            "Year": years,
                            "Both_Sexes" : rate_both_clean,
                            "Male": rate_men_clean,
                            "Female" : rate_women_clean})

ac_clean_df.head()

  Country_Name  Year Both_Sexes  Male Female
0  Afghanistan  2016        0.2   0.4      0
1  Afghanistan  2010        0.2   0.4      0
2      Albania  2016        7.5  12.5    2.6
3      Albania  2010        7.9    13    2.8
4      Algeria  2016        0.9   1.7    0.2

In [9]:
len(ac_clean_df['Country_Name'])/2
# Data Load
# rds_connection_string = "<username>:<password>@localhost:5432/customer_db"
# engine = create_engine(f'postgresql://{rds_connection_string}')

194.0

In [10]:
len(pc.countries)

249

In [11]:
country_names = []

for country in pc.countries:
    country_names.append(country.name)
    
# country_names

In [12]:
country_id = []

for country in pc.countries:
    country_id.append(country.numeric)
    
# country_id

In [13]:
country_abbreviation = []

for country in pc.countries:
    country_abbreviation.append(country.alpha_3)
    
# country_abbreviation

In [14]:
pc_table = pd.DataFrame({"Country_ID": country_id,
                         "Country_Name": country_names})
pc_table.head()

  Country_ID   Country_Name
0        533          Aruba
1        004    Afghanistan
2        024         Angola
3        660       Anguilla
4        248  Åland Islands

In [15]:
# alcohol_consumption_clean_df['Country_Name'].unique()

In [16]:
# country_table['Country_Name'].unique()

In [17]:
# s = set(alcohol_consumption_clean_df['Country_Name'])
# no_match = [x for x in country_names if x not in s]

In [18]:
# len(no_match)
# no_match

In [19]:
ac_new_df = ac_clean_df.set_index('Country_Name')
ac_new_df.head()

              Year Both_Sexes  Male Female
Country_Name
Afghanistan   2016        0.2   0.4      0
Afghanistan   2010        0.2   0.4      0
Albania       2016        7.5  12.5    2.6
Albania       2010        7.9    13    2.8
Algeria       2016        0.9   1.7    0.2

In [20]:
name_list = []

for country in pc.countries:
    name_list.append(country.name)
    
for row, value in ac_new_df.iterrows():
    if row not in name_list:
        print("ERROR: " + row)

ERROR: Bolivia (Plurinational State of)
ERROR: Bolivia (Plurinational State of)
ERROR: Democratic People's Republic of Korea
ERROR: Democratic People's Republic of Korea
ERROR: Democratic Republic of the Congo
ERROR: Democratic Republic of the Congo
ERROR: Iran (Islamic Republic of)
ERROR: Iran (Islamic Republic of)
ERROR: Micronesia (Federated States of)
ERROR: Micronesia (Federated States of)
ERROR: Republic of Korea
ERROR: Republic of Korea
ERROR: Republic of Moldova
ERROR: Republic of Moldova
ERROR: Republic of North Macedonia
ERROR: Republic of North Macedonia
ERROR: United Kingdom of Great Britain and Northern Ireland
ERROR: United Kingdom of Great Britain and Northern Ireland
ERROR: United Republic of Tanzania
ERROR: United Republic of Tanzania
ERROR: United States of America
ERROR: United States of America
ERROR: Venezuela (Bolivarian Republic of)
ERROR: Venezuela (Bolivarian Republic of)

In [21]:
pc_table['Country_Name'].unique()

array(['Aruba', 'Afghanistan', 'Angola', 'Anguilla', 'Åland Islands',
       'Albania', 'Andorra', 'United Arab Emirates', 'Argentina',
       'Armenia', 'American Samoa', 'Antarctica',
       'French Southern Territories', 'Antigua and Barbuda', 'Australia',
       'Austria', 'Azerbaijan', 'Burundi', 'Belgium', 'Benin',
       'Bonaire, Sint Eustatius and Saba', 'Burkina Faso', 'Bangladesh',
       'Bulgaria', 'Bahrain', 'Bahamas', 'Bosnia and Herzegovina',
       'Saint Barthélemy', 'Belarus', 'Belize', 'Bermuda',
       'Bolivia, Plurinational State of', 'Brazil', 'Barbados',
       'Brunei Darussalam', 'Bhutan', 'Bouvet Island', 'Botswana',
       'Central African Republic', 'Canada', 'Cocos (Keeling) Islands',
       'Switzerland', 'Chile', 'China', "Côte d'Ivoire", 'Cameroon',
       'Congo, The Democratic Republic of the', 'Congo', 'Cook Islands',
       'Colombia', 'Comoros', 'Cabo Verde', 'Costa Rica', 'Cuba',
       'Curaçao', 'Christmas Island', 'Cayman Islands', 'Cyprus',
       'Czechia', 'Germany', 'Djibouti', 'Dominica', 'Denmark',
       'Dominican Republic', 'Algeria', 'Ecuador', 'Egypt', 'Eritrea',
       'Western Sahara', 'Spain', 'Estonia', 'Ethiopia', 'Finland',
       'Fiji', 'Falkland Islands (Malvinas)', 'France', 'Faroe Islands',
       'Micronesia, Federated States of', 'Gabon', 'United Kingdom',
       'Georgia', 'Guernsey', 'Ghana', 'Gibraltar', 'Guinea',
       'Guadeloupe', 'Gambia', 'Guinea-Bissau', 'Equatorial Guinea',
       'Greece', 'Grenada', 'Greenland', 'Guatemala', 'French Guiana',
       'Guam', 'Guyana', 'Hong Kong', 'Heard Island and McDonald Islands',
       'Honduras', 'Croatia', 'Haiti', 'Hungary', 'Indonesia',
       'Isle of Man', 'India', 'British Indian Ocean Territory',
       'Ireland', 'Iran, Islamic Republic of', 'Iraq', 'Iceland',
       'Israel', 'Italy', 'Jamaica', 'Jersey', 'Jordan', 'Japan',
       'Kazakhstan', 'Kenya', 'Kyrgyzstan', 'Cambodia', 'Kiribati',
       'Saint Kitts and Nevis', 'Korea, Republic of', 'Kuwait',
       "Lao People's Democratic Republic", 'Lebanon', 'Liberia', 'Libya',
       'Saint Lucia', 'Liechtenstein', 'Sri Lanka', 'Lesotho',
       'Lithuania', 'Luxembourg', 'Latvia', 'Macao',
       'Saint Martin (French part)', 'Morocco', 'Monaco',
       'Moldova, Republic of', 'Madagascar', 'Maldives', 'Mexico',
       'Marshall Islands', 'North Macedonia', 'Mali', 'Malta', 'Myanmar',
       'Montenegro', 'Mongolia', 'Northern Mariana Islands', 'Mozambique',
       'Mauritania', 'Montserrat', 'Martinique', 'Mauritius', 'Malawi',
       'Malaysia', 'Mayotte', 'Namibia', 'New Caledonia', 'Niger',
       'Norfolk Island', 'Nigeria', 'Nicaragua', 'Niue', 'Netherlands',
       'Norway', 'Nepal', 'Nauru', 'New Zealand', 'Oman', 'Pakistan',
       'Panama', 'Pitcairn', 'Peru', 'Philippines', 'Palau',
       'Papua New Guinea', 'Poland', 'Puerto Rico',
       "Korea, Democratic People's Republic of", 'Portugal', 'Paraguay',
       'Palestine, State of', 'French Polynesia', 'Qatar', 'Réunion',
       'Romania', 'Russian Federation', 'Rwanda', 'Saudi Arabia', 'Sudan',
       'Senegal', 'Singapore',
       'South Georgia and the South Sandwich Islands',
       'Saint Helena, Ascension and Tristan da Cunha',
       'Svalbard and Jan Mayen', 'Solomon Islands', 'Sierra Leone',
       'El Salvador', 'San Marino', 'Somalia',
       'Saint Pierre and Miquelon', 'Serbia', 'South Sudan',
       'Sao Tome and Principe', 'Suriname', 'Slovakia', 'Slovenia',
       'Sweden', 'Eswatini', 'Sint Maarten (Dutch part)', 'Seychelles',
       'Syrian Arab Republic', 'Turks and Caicos Islands', 'Chad', 'Togo',
       'Thailand', 'Tajikistan', 'Tokelau', 'Turkmenistan', 'Timor-Leste',
       'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Tuvalu',
       'Taiwan, Province of China', 'Tanzania, United Republic of',
       'Uganda', 'Ukraine', 'United States Minor Outlying Islands',
       'Uruguay', 'United States', 'Uzbekistan',
       'Holy See (Vatican City State)',
       'Saint Vincent and the Grenadines',
       'Venezuela, Bolivarian Republic of', 'Virgin Islands, British',
       'Virgin Islands, U.S.', 'Viet Nam', 'Vanuatu', 'Wallis and Futuna',
       'Samoa', 'Yemen', 'South Africa', 'Zambia', 'Zimbabwe'],
      dtype=object)

In [22]:
ac_new_df.rename(index={
        "Bolivia (Plurinational State of)": "Bolivia, Plurinational State of",
        "Democratic People's Republic of Korea": "Korea, Democratic People's Republic of",
        "Democratic Republic of the Congo": "Congo",
        "Iran (Islamic Republic of)": "Iran, Islamic Republic of",
        "Micronesia (Federated States of)": "Micronesia, Federated States of",
        "Republic of Korea":"Korea, Republic of",
        "Republic of Moldova":"Moldova, Republic of",
        "Republic of North Macedonia" : "North Macedonia",
        "United Kingdom of Great Britain and Northern Ireland":"United Kingdom",
        "United Republic of Tanzania":"Tanzania, United Republic of",
        "United States of America":"United States",
        "Venezuela (Bolivarian Republic of)":"Venezuela, Bolivarian Republic of"}, inplace=True)

In [23]:
for row, value in ac_new_df.iterrows():
    if row not in name_list:
        print("ERROR: " + row)

In [24]:
ac_new_df.head()

              Year Both_Sexes  Male Female
Country_Name
Afghanistan   2016        0.2   0.4      0
Afghanistan   2010        0.2   0.4      0
Albania       2016        7.5  12.5    2.6
Albania       2010        7.9    13    2.8
Algeria       2016        0.9   1.7    0.2

In [25]:
country_dict = dict(zip(name_list, country_id))

In [26]:
new_col=[]

# Loop through indexes and get country_id
for row, value in ac_new_df.iterrows():
    if row in country_dict:
        new_col.append(country_dict[row])
        
ac_new_df['country_id'] = new_col

ac_new_df = ac_new_df.reset_index()
ac_new_df.head()

  Country_Name  Year Both_Sexes  Male Female country_id
0  Afghanistan  2016        0.2   0.4      0        004
1  Afghanistan  2010        0.2   0.4      0        004
2      Albania  2016        7.5  12.5    2.6        008
3      Albania  2010        7.9    13    2.8        008
4      Algeria  2016        0.9   1.7    0.2        012

In [27]:
# remove 2010 from dataframe 
indexNames = ac_new_df[ac_new_df['Year'] == 2010 ].index
 
# Delete these row indexes from dataFrame
ac_2016_df = ac_new_df.drop(indexNames , inplace=False)

In [28]:
ac_2016_df = ac_2016_df.set_index('country_id')

ac_2016_df.head()

           Country_Name  Year Both_Sexes  Male Female
country_id
004         Afghanistan  2016        0.2   0.4      0
008             Albania  2016        7.5  12.5    2.6
012             Algeria  2016        0.9   1.7    0.2
020             Andorra  2016       11.3    18    4.7
024              Angola  2016        6.4  10.7    2.3